Revit 2027 API
CutterFailures Properties
The BuiltInFailures.CutterFailures type exposes the following members.
Properties
Name | Description
MakeCutterForPlanRegionsGStepFailed |  Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
MakeCutterForSectionGStepFailed |  Attempt to create or manipulate a segmented section has failed.
Top
See Also
Reference
BuiltInFailures.CutterFailures Class
Autodesk.Revit.DB Namespace